// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет


Console.Write("Введите число дня недели: ");
int a = Convert.ToInt32(Console.ReadLine());
if (a > 0 && a < 6)
{
    Console.Write("День не является выходным");
}
else if (a == 6 || a == 7)
{
    Console.Write("День является выходным");
}
else
{
    Console.Write("число введено неверно");
}
