// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.Write("Введите трехзначное число: ");
int a = Convert.ToInt32(Console.ReadLine());
if (a > 99 && a < 1000)
{
    int x = a % 100/10;
    Console.Write(x);
}
else
{
    Console.Write("Число не является трёхзначным");
}
