// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6



int a = new Random().Next(10, 999);
if (a > 99)
{
    int b = a % 10;
    Console.Write($"заданное число {a}, третья цифра {b}");
}
else
    Console.Write($"заданное число {a}, третьей цифры нет");


